module.exports = {
    command_not_available_md: `_Команда не найдена_
    Возможные причины: 
    - ошибка в названии команды
    - команды не существует для данного бота
    - команда не зарезервирована botFather
    - не использован "/" вначале команды 
      пример: /help`,
    command_error_md: `_Ошибка анализа команды_
    - команда должна начинаться с "/"`,
    generate_persone_error_md: `При создании карточки сотрудника обязательно указать поля: 
    - фамилия
    - смена
    - должность
    `
}